# 0310

Related links

- [Course website](https://www-math.nsysu.edu.tw/~chlin/2025SMath599/2025SMath599.html)
- [Python Data Science Handbook](https://jakevdp.github.io/PythonDataScienceHandbook/)

## Data

In [1]:
import numpy as np

In [2]:
### load nsysu

import os
import urllib
import numpy as np

base = r"https://github.com/SageLabTW/auto-grading/raw/master/nsysu-digits/"
for c in ['X', 'y']:
    filename = "nsysu-digits-%s.csv"%c
    if filename not in os.listdir('.'):
        print(filename, 'not found --- will download')
        urllib.request.urlretrieve(base + c + ".csv", filename)

Xsys = np.genfromtxt('nsysu-digits-X.csv', dtype=int, delimiter=',') ### flattened already
ysys = np.genfromtxt('nsysu-digits-y.csv', dtype=int, delimiter=',')

In [3]:
# load MNIST (long)

from sklearn.datasets import fetch_openml
mnist = fetch_openml('mnist_784')

[Sample DataFrame](https://docs.google.com/spreadsheets/d/1pzcuTVMyRhBrwmcpOnGILUjMsPeF8fjkSSLwUuevXJ0/edit?usp=sharing)

## 3. [Data Manipulation with Pandas](https://jakevdp.github.io/PythonDataScienceHandbook/03.00-introduction-to-pandas.html)

`pip install pandas` in shell, or  
`!pip install pandas`

pandas = panel data(s)

In [4]:
import pandas as pd
pd.__version__

'2.2.3'

## [Introducing Pandas Objects](https://jakevdp.github.io/PythonDataScienceHandbook/03.01-introducing-pandas-objects.html)

- `Series`
- `DataFrame`
- `Index`

`Series` = 1D array + index

In [5]:
# better index system
s = pd.Series([5,5,5,6,6,6], 
              index=["A", "B", "C", "D", "E", "F"])
s

A    5
B    5
C    5
D    6
E    6
F    6
dtype: int64

In [6]:
# dict: {name: score}
data = {"A": 5, "B": 5, "C": 5, 
        "D": 6, "E": 6, "F": 6}
s = pd.Series(data)
s

A    5
B    5
C    5
D    6
E    6
F    6
dtype: int64

In [7]:
# easy to create new feature: mean, sum, weighted total
data = {"HW1": 5, "HW2": 5, "HW3": 5, 
        "Exam1": 6, "Exam2": 6, "Exam3": 6}
s = pd.Series(data)
s["HW1":"HW3"].sum()

np.int64(15)

In [8]:
print(s.index)
s.index.str.startswith("HW")

Index(['HW1', 'HW2', 'HW3', 'Exam1', 'Exam2', 'Exam3'], dtype='object')

array([ True,  True,  True, False, False, False])

`DataFrame` = 2D array + index

In [9]:
# scores: students vs score categories
df = pd.DataFrame(
    [[1,1,1,1],
     [2,2,2,2],
     [3,3,3,3]],
    index=["Alice", "Bob", "Charles"],
    columns=["HW1","HW2","HW3","Final"]
)
df

         HW1  HW2  HW3  Final
Alice      1    1    1      1
Bob        2    2    2      2
Charles    3    3    3      3

In [10]:
# index vs column
print(df.index)
print(df.columns)

Index(['Alice', 'Bob', 'Charles'], dtype='object')
Index(['HW1', 'HW2', 'HW3', 'Final'], dtype='object')

`DataFrame` = list of dicts

In [11]:
# list of lists
df = pd.DataFrame(
    [[1,1,1,1],
     [2,2,2,2],
     [3,3,3,3]],
    index=["Alice", "Bob", "Charles"],
    columns=["HW1","HW2","HW3","Final"]
)
df

         HW1  HW2  HW3  Final
Alice      1    1    1      1
Bob        2    2    2      2
Charles    3    3    3      3

In [12]:
# list of dicts
df = pd.DataFrame(
    [{"HW1": 1, "HW2": 1, "HW3": 1, "Final":1},
     {"HW1": 2, "HW2": 2, "HW3": 2, "Final":2},
     {"HW1": 3, "HW2": 3, "HW3": 3, "Final":3}],
    index=["Alice", "Bob", "Charles"]
)
df

         HW1  HW2  HW3  Final
Alice      1    1    1      1
Bob        2    2    2      2
Charles    3    3    3      3

In [13]:
# list of Series
df = pd.DataFrame(
    [pd.Series({"HW1": 1, "HW2": 1, "HW3": 1, "Final":1}),
     pd.Series({"HW1": 2, "HW2": 2, "HW3": 2, "Final":2}),
     pd.Series({"HW1": 3, "HW2": 3, "HW3": 3, "Final":3})],
    index=["Alice", "Bob", "Charles"]
)
df

         HW1  HW2  HW3  Final
Alice      1    1    1      1
Bob        2    2    2      2
Charles    3    3    3      3

`DataFrame` = dict of list

In [14]:
# dict of lists
df = pd.DataFrame(
    {"HW1": [1,2,3],
     "HW2": [1,2,3],
     "HW3": [1,2,3],
     "Final": [1,2,3]},
    index=["Alice", "Bob", "Charles"]
)
df

         HW1  HW2  HW3  Final
Alice      1    1    1      1
Bob        2    2    2      2
Charles    3    3    3      3

In [15]:
# dict of dicts

In [16]:
# dict of Series

`Index` = bijection between labels and indices

In [17]:
# scores of five subjects
pd.Index(["chinese", "english", "math", "n-science", "s-science"])

Index(['chinese', 'english', 'math', 'n-science', 's-science'], dtype='object')

In [18]:
df = pd.read_csv("sample-df.csv")
df

      NAME  HW1  HW2  HW3  HW4  HW5  Exam1  Exam2  Exam3
0    Alice   65   62   51   21   86     60      6     25
1      Bob   42   49   56   14   22     81     59     32
2  Charles   93   93   23   40   42     63     34     28

## [Data Indexing and Selection](https://jakevdp.github.io/PythonDataScienceHandbook/03.02-data-indexing-and-selection.html)

In [19]:
df = pd.read_csv("sample-df.csv").set_index("NAME")
df

         HW1  HW2  HW3  HW4  HW5  Exam1  Exam2  Exam3
NAME
Alice     65   62   51   21   86     60      6     25
Bob       42   49   56   14   22     81     59     32
Charles   93   93   23   40   42     63     34     28

`Series`

In [20]:
alice = df.iloc[0]
alice

HW1      65
HW2      62
HW3      51
HW4      21
HW5      86
Exam1    60
Exam2     6
Exam3    25
Name: Alice, dtype: int64

In [21]:
# as dict
print(alice["HW3"])
print(alice[2])

51
51

C:\Users\User\AppData\Local\Temp\ipykernel_26040\3046037039.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(alice[2])

In [22]:
# slicing
alice["HW1":"HW5"]

HW1    65
HW2    62
HW3    51
HW4    21
HW5    86
Name: Alice, dtype: int64

In [23]:
# mask
alice >= 60

HW1       True
HW2       True
HW3      False
HW4      False
HW5       True
Exam1     True
Exam2    False
Exam3    False
Name: Alice, dtype: bool

In [24]:
# fancy indexing
alice[["HW5","HW1"]]

HW5    86
HW1    65
Name: Alice, dtype: int64

`loc` vs `iloc`

In [25]:
num_name = pd.Series(["two", "three", "five"],
              index=[2,3,5])
num_name

2      two
3    three
5     five
dtype: object

In [26]:
num_name[2] # priority: label (2,3,5) > index (0,1,2)

'two'

In [27]:
# loc: find by label
num_name.loc[2]

'two'

In [28]:
# iloc: find by index
num_name.iloc[2]

'five'

`DataFrame`

In [29]:
# column-based by default
df["HW1"]

NAME
Alice      65
Bob        42
Charles    93
Name: HW1, dtype: int64

In [30]:
df.HW1

NAME
Alice      65
Bob        42
Charles    93
Name: HW1, dtype: int64

In [31]:
df["HW1+HW2"] = df["HW1"] + df["HW2"]
df

         HW1  HW2  HW3  HW4  HW5  Exam1  Exam2  Exam3  HW1+HW2
NAME
Alice     65   62   51   21   86     60      6     25      127
Bob       42   49   56   14   22     81     59     32       91
Charles   93   93   23   40   42     63     34     28      186

In [32]:
# row-based when loc or iloc is used
df.loc["Alice"]

HW1         65
HW2         62
HW3         51
HW4         21
HW5         86
Exam1       60
Exam2        6
Exam3       25
HW1+HW2    127
Name: Alice, dtype: int64

In [33]:
# df.values
df.values

array([[ 65,  62,  51,  21,  86,  60,   6,  25, 127],
       [ 42,  49,  56,  14,  22,  81,  59,  32,  91],
       [ 93,  93,  23,  40,  42,  63,  34,  28, 186]])

### Try on titanic dataset

In [34]:
data = fetch_openml("titanic", version=1, as_frame=True)
print(data["DESCR"])

**Author**: Frank E. Harrell Jr., Thomas Cason
**Source**: [Vanderbilt Biostatistics](http://biostat.mc.vanderbilt.edu/wiki/pub/Main/DataSets/titanic.html)
**Please cite**:

The original Titanic dataset, describing the survival status of individual passengers on the Titanic. The titanic data does not contain information from the crew, but it does contain actual ages of half of the passengers. The principal source for data about Titanic passengers is the Encyclopedia Titanica. The datasets used here were begun by a variety of researchers. One of the original sources is Eaton & Haas (1994) Titanic: Triumph and Tragedy, Patrick Stephens Ltd, which includes a passenger list created by many researchers and edited by Michael A. Findlay.

Thomas Cason of UVa has greatly updated and improved the titanic data frame using the Encyclopedia Titanica and created the dataset here. Some duplicate passengers have been dropped, many errors corrected, many missing ages filled in, and new variables created.

For more information about how this dataset was constructed:
http://biostat.mc.vanderbilt.edu/wiki/pub/Main/DataSets/titanic3info.txt


### Attribute information

The variables on our extracted dataset are pclass, survived, name, age, embarked, home.dest, room, ticket, boat, and sex. pclass refers to passenger class (1st, 2nd, 3rd), and is a proxy for socio-economic class. Age is in years, and some infants had fractional values. The titanic2 data frame has no missing data and includes records for the crew, but age is dichotomized at adult vs. child. These data were obtained from Robert Dawson, Saint Mary's University, E-mail. The variables are pclass, age, sex, survived. These data frames are useful for demonstrating many of the functions in Hmisc as well as demonstrating binary logistic regression analysis using the Design library. For more details and references see Simonoff, Jeffrey S (1997): The "unusual episode" and a second statistics course. J Statistics Education, Vol. 5 No. 1.

Downloaded from openml.org.

In [35]:
from sklearn.datasets import fetch_openml
X, y = fetch_openml("titanic", version=1, as_frame=True, return_X_y=True)

machine learning workflow:  
- use training data: X_train, y_train to train
- make a prediction by X_new to generate y_new

In [36]:
print(X.shape)
print(X.index)
print(X.columns)
print(X.dtypes)

(1309, 13)
RangeIndex(start=0, stop=1309, step=1)
Index(['pclass', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket', 'fare',
       'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')
pclass          int64
name           object
sex          category
age           float64
sibsp           int64
parch           int64
ticket         object
fare          float64
cabin          object
embarked     category
boat           object
body          float64
home.dest      object
dtype: object

In [37]:
f_mask = (X.sex == "female")
m_mask = ~f_mask

In [38]:
X.loc[f_mask]

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,"Allen, Miss. Elisabeth Walton",female,29.0,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
2,1,"Allison, Miss. Helen Loraine",female,2.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
6,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
8,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1286,3,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0,0,0,2688,7.2292,NaN,C,C,NaN,NaN
1290,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN,NaN,NaN
1300,3,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.0,1,0,2659,14.4542,NaN,C,NaN,NaN,NaN
1304,3,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN

In [39]:
import numpy as np
print(np.sum(y[f_mask] == '0'))
print(np.sum(y[f_mask] == '1'))

127
339

In [40]:
print(np.sum(y[m_mask] == '0'))
print(np.sum(y[m_mask] == '1'))

682
161

## [Operating on Data in Pandas](https://jakevdp.github.io/PythonDataScienceHandbook/03.03-operations-in-pandas.html)

universal function and index alignment

In [41]:
# recall ufunction on numpy
import numpy as np
a = np.array([1,2,3])
b = np.array([1,1,1])
a + b

array([2, 3, 4])

In [42]:
# Series
a = pd.Series([1,2,3])
b = pd.Series([1,1,1])
a + b

0    2
1    3
2    4
dtype: int64

In [43]:
# index alignment
a = pd.Series([1,2,3], index=["apple", "orange", "tomato"])
b = pd.Series([1,1,1], index=["apple", "tomato", "banana"])
a.add(b, fill_value=0)

apple     2.0
banana    1.0
orange    2.0
tomato    4.0
dtype: float64

In [44]:
a.add(b)

apple     2.0
banana    NaN
orange    NaN
tomato    4.0
dtype: float64

In [45]:
# DataFrame

## [Handling Missing Data](https://jakevdp.github.io/PythonDataScienceHandbook/03.04-missing-values.html)

trade-off: extra storage or a special value

`np.nan` vs `None`  

- speed
- operation

In [46]:
# None cannot work with other opeartions
None + 1

TypeError: unsupported operand type(s) for +: 'NoneType' and 'int'

In [ ]:
type(None)

NoneType

In [ ]:
# np.nan will propagate
np.nan * 100

nan

In [ ]:
type(np.nan)

float

pandas handling NA

In [ ]:
s = pd.Series([None, np.nan, "one", "two"])
print(s.dtype)
print(s)

object
0    None
1     NaN
2     one
3     two
dtype: object

In [ ]:
# float: np.nan
s = pd.Series([None, np.nan, 1.1, 3.14])
print(s.dtype)
s

float64

0     NaN
1     NaN
2    1.10
3    3.14
dtype: float64

In [ ]:
# integer: upcast to float
s = pd.Series([None, np.nan, 1, 2])
print(s.dtype)
s

float64

0    NaN
1    NaN
2    1.0
3    2.0
dtype: float64

In [ ]:
# object: keep both
s = pd.Series([None, np.nan, "one", "two"])
print(s.dtype)
s

object

0    None
1     NaN
2     one
3     two
dtype: object

In [ ]:
# boolean: keep both
s = pd.Series([None, np.nan, True, False])
print(s.dtype)
s

object

0     None
1      NaN
2     True
3    False
dtype: object

Working with NA

In [ ]:
# isnull and notnull
s = pd.Series([None, np.nan, "one", "two"])
s.isnull()
s.notnull()

0    False
1    False
2     True
3     True
dtype: bool

In [ ]:
# dropna
s.dropna()

2    one
3    two
dtype: object

In [ ]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]],
                  index=["A", "B", "C"],
                  columns=["HW1", "HW2", "HW3"]
                 )
df

   HW1  HW2  HW3
A  1.0  NaN    2
B  2.0  3.0    5
C  NaN  4.0    6

In [ ]:
df.dropna()

   HW1  HW2  HW3
B  2.0  3.0    5

In [ ]:
df["HW4"] = None
df

   HW1  HW2  HW3   HW4
A  1.0  NaN    2  None
B  2.0  3.0    5  None
C  NaN  4.0    6  None

In [ ]:
# how (default is any)
df.dropna(axis=1, how="all")

   HW1  HW2  HW3
A  1.0  NaN    2
B  2.0  3.0    5
C  NaN  4.0    6

In [ ]:
# fillna
df.fillna(0)

C:\Users\User\AppData\Local\Temp\ipykernel_8160\2477898854.py:2: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.fillna(0)

   HW1  HW2  HW3  HW4
A  1.0  0.0    2    0
B  2.0  3.0    5    0
C  0.0  4.0    6    0

## Homework

- Type your answers here and submit your answer in `*.ipynb` format.
- You may use code cell and Markdown cell.

In [ ]:
NAME = "李瑋宸" # change to your name
STD_ID = "B123245008" # change to your student ID
print("My name is %s and my student ID is %s."%(NAME, STD_ID))

My name is 李瑋宸 and my student ID is B123245008.

### Exercise 1: Creating Series
Create a Pandas Series from a list of integers `[10, 20, 30, 40, 50]`. Assign custom index labels `['a', 'b', 'c', 'd', 'e']`. Display the series.

In [ ]:
df=pd.Series([10, 20, 30, 40, 50],index=['a', 'b', 'c', 'd', 'e'])
print(df)

a    10
b    20
c    30
d    40
e    50
dtype: int64

### Exercise 2: Creating DataFrame
Create a Pandas DataFrame from a dictionary with columns `"Name"`, `"Age"`, and `"City"`. Populate it with at least three rows of data.

In [ ]:
table = pd.DataFrame(
    {
        "Name":["Alice","Bob","Charles"],
        "Age":[10,20,30],
        "City":["LA","NYC","Miami"]
    }
)
print(table)

      Name  Age   City
0    Alice   10     LA
1      Bob   20    NYC
2  Charles   30  Miami

### Exercise 3: Understanding Indexing
Explain the difference between implicit (`iloc`) and explicit (`loc`) indexing in Pandas. Provide an example to illustrate the difference.

In [ ]:
#explicit is using tag name
#implicit is using index

### Exercise 4: Selecting Data from a DataFrame
Using the DataFrame from Exercise 2, perform the following operations:
- Select all rows where `Age` is greater than 25.
- Select only the `Name` column.
- Select the first two rows using `.iloc`.

In [ ]:
print(table[(table["Age"])>25],"\n")
print(table["Name"],"\n")
print(table.iloc[0:2])

      Name  Age   City
2  Charles   30  Miami

0      Alice
1        Bob
2    Charles
Name: Name, dtype: object

    Name  Age City
0  Alice   10   LA
1    Bob   20  NYC

### Exercise 5: Boolean Masking
Given the following DataFrame:

```python
import pandas as pd

data = {'A': [1, 2, 3, 4, 5], 'B': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)
```

Filter out rows where column `A` has values greater than 2.

In [ ]:
import pandas as pd

data = {'A': [1, 2, 3, 4, 5], 'B': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)
mask = df["A"]>2
print(df[mask])

   A   B
2  3  30
3  4  40
4  5  50

### Exercise 6: Applying Functions
Using the DataFrame from Exercise 5, apply a lambda function to double the values in column `B`.

In [ ]:
ans = df["B"]
x = lambda a : a * 2
print(x(ans))

0     20
1     40
2     60
3     80
4    100
Name: B, dtype: int64

### Exercise 7: Aggregation
Using the DataFrame from Exercise 5, calculate the mean and standard deviation for each column.

In [ ]:
import math
print("A mean: ",df["A"].mean())
print("B mean:",df["B"].mean())
print("A standard deviation",df["A"].std())
print("B standard deviation",df["B"].std())
x = lambda a : pow((a - a.mean()),2)
print("A standard deviation",math.sqrt((x(df["A"])).sum()/(df["A"].size-1)))
print("B standard deviation",math.sqrt((x(df["B"])).sum()/(df["B"].size-1)))

A mean:  3.0
B mean: 30.0
A standard deviation 1.5811388300841898
B standard deviation 15.811388300841896
A standard deviation 1.5811388300841898
B standard deviation 15.811388300841896

### Exercise 8: Element-wise Operations
Create a Pandas Series with values `[5, 10, 15, 20]`. Multiply all values by 2 using vectorized operations.

In [ ]:
df = pd.Series([5, 10, 15, 20])
print(df*2)

0    10
1    20
2    30
3    40
dtype: int64

### Exercise 9: Detecting Missing Values
Create a DataFrame with missing values:

```python
data = {'A': [1, 2, None, 4], 'B': [None, 20, 30, 40]}
df = pd.DataFrame(data)
```

Identify which values are missing.

In [ ]:
data = {'A': [1, 2, None, 4], 'B': [None, 20, 30, 40]}
df = pd.DataFrame(data)
print(df.isna())

       A      B
0  False   True
1  False  False
2   True  False
3  False  False

### Exercise 10: Filling Missing Data
Using the DataFrame from Exercise 9, fill missing values in column `A` with the mean of the column and replace missing values in column `B` with `0`.

In [ ]:
df["A"] = df["A"].fillna(df["A"].mean())
df["B"] = df["B"].fillna(0)
df

          A     B
0  1.000000   0.0
1  2.000000  20.0
2  2.333333  30.0
3  4.000000  40.0